"""
1、匹配年月日日期 格式2018-12-6
"""
import re
# result = re.search('[1-9]\d{0,3}-(1[0-2]|0?[1-9])-(3[01]|[12]\d|0?[1-9])','2018-12-6').group()
# print(result)

'''
2、长度为8-10位的用户密码 ： 包含数字字母下划线
'''
# a = re.findall(r'[0-9a-zA-Z_]{8,10}','89vsya90')
# print(a)

'''
3、匹配验证码：4位数字字母组成的
'''
# a = re.findall(r'[0-9a-zA-z]{4}','fajh')
# print(a)

'''
1）匹配出wahaha，banana，qqxing内容。
'''
# a = re.findall('</?\w+>','<a>wahaha</a>')
# print(a)

'''
5、1-2\*((60-30+(-40/5)\*(9-2\*5/3+7/3\*99/4\*2998+10\*568/14))-(-4\*3)/(16-3\*2))
从上面算式中匹配出最内层小括号以及小括号内的表达式
'''
a = re.findall(r'\([^()]+\)','1-2\*((60-30+(-40/5)\*(9-2\*5/3+7/3\*99/4\*2998+10\*568/14))-(-4\*3)/(16-3\*2))')
print(a)